/* automatically generated by rust-bindgen 0.69.4 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __WORDSIZE: u32 = 64;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;
pub const INT8_MAX: u32 = 127;

pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i32 = -32768;
pub const INT_FAST32_MIN: i32 = -2147483648;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u32 = 32767;
pub const INT_FAST32_MAX: u32 = 2147483647;
pub const INT_FAST64_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: u32 = 65535;
pub const UINT_FAST32_MAX: u32 = 4294967295;
pub const UINT_FAST64_MAX: i32 = -1;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const UINTPTR_MAX: i32 = -1;
pub const SIZE_MAX: i32 = -1;
pub const RSIZE_MAX: i32 = -1;
pub const WINT_MIN: i32 = -2147483648;
pub const WINT_MAX: u32 = 2147483647;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type BinaryenIndex = u32;
pub type BinaryenType = usize;
extern "C" {
    pub fn BinaryenTypeNone() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeInt32() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeInt64() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeFloat32() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeFloat64() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeVec128() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeFuncref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeExternref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeAnyref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeEqref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeI31ref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeStructref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeArrayref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeStringref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeStringviewWTF8() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeStringviewWTF16() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeStringviewIter() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeNullref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeNullExternref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeNullFuncref() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeUnreachable() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeAuto() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeCreate(
        valueTypes: *mut BinaryenType,
        numTypes: BinaryenIndex,
    ) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeArity(t: BinaryenType) -> u32;
}
extern "C" {
    pub fn BinaryenTypeExpand(t: BinaryenType, buf: *mut BinaryenType);
}
extern "C" {
    pub fn BinaryenNone() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenInt32() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenInt64() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenFloat32() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenFloat64() -> BinaryenType;
}
extern "C" {
    pub fn BinaryenUndefined() -> BinaryenType;
}
pub type BinaryenPackedType = u32;
extern "C" {
    pub fn BinaryenPackedTypeNotPacked() -> BinaryenPackedType;
}
extern "C" {
    pub fn BinaryenPackedTypeInt8() -> BinaryenPackedType;
}
extern "C" {
    pub fn BinaryenPackedTypeInt16() -> BinaryenPackedType;
}
pub type BinaryenHeapType = usize;
extern "C" {
    pub fn BinaryenHeapTypeExt() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeFunc() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeAny() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeEq() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeI31() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeStruct() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeArray() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeString() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeStringviewWTF8() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeStringviewWTF16() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeStringviewIter() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeNone() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeNoext() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeNofunc() -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeIsBasic(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenHeapTypeIsSignature(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenHeapTypeIsStruct(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenHeapTypeIsArray(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenHeapTypeIsBottom(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenHeapTypeGetBottom(heapType: BinaryenHeapType) -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenHeapTypeIsSubType(left: BinaryenHeapType, right: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenStructTypeGetNumFields(heapType: BinaryenHeapType) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenStructTypeGetFieldType(
        heapType: BinaryenHeapType,
        index: BinaryenIndex,
    ) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenStructTypeGetFieldPackedType(
        heapType: BinaryenHeapType,
        index: BinaryenIndex,
    ) -> BinaryenPackedType;
}
extern "C" {
    pub fn BinaryenStructTypeIsFieldMutable(
        heapType: BinaryenHeapType,
        index: BinaryenIndex,
    ) -> bool;
}
extern "C" {
    pub fn BinaryenArrayTypeGetElementType(heapType: BinaryenHeapType) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenArrayTypeGetElementPackedType(heapType: BinaryenHeapType) -> BinaryenPackedType;
}
extern "C" {
    pub fn BinaryenArrayTypeIsElementMutable(heapType: BinaryenHeapType) -> bool;
}
extern "C" {
    pub fn BinaryenSignatureTypeGetParams(heapType: BinaryenHeapType) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenSignatureTypeGetResults(heapType: BinaryenHeapType) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenTypeGetHeapType(type_: BinaryenType) -> BinaryenHeapType;
}
extern "C" {
    pub fn BinaryenTypeIsNullable(type_: BinaryenType) -> bool;
}
extern "C" {
    pub fn BinaryenTypeFromHeapType(heapType: BinaryenHeapType, nullable: bool) -> BinaryenType;
}
pub type BinaryenExpressionId = u32;
extern "C" {
    pub fn BinaryenInvalidId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenNopId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenBlockId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenIfId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenLoopId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenBreakId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSwitchId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenCallId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenCallIndirectId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenLocalGetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenLocalSetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenGlobalGetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenGlobalSetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenLoadId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStoreId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenAtomicRMWId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenAtomicWaitId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenAtomicNotifyId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenAtomicFenceId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDExtractId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDReplaceId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDShuffleId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDTernaryId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDShiftId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDLoadId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenMemoryInitId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenDataDropId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenMemoryCopyId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenMemoryFillId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenConstId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenUnaryId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenBinaryId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenSelectId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenDropId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenReturnId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenMemorySizeId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenMemoryGrowId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenUnreachableId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenPopId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefNullId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefIsNullId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefFuncId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefEqId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableGetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableSetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableSizeId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableGrowId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableFillId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTableCopyId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTryId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTryTableId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenThrowId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRethrowId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenThrowRefId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTupleMakeId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenTupleExtractId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefI31Id() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenI31GetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenCallRefId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefTestId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefCastId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenBrOnId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStructNewId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStructGetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStructSetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayNewId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayNewDataId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayNewElemId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayNewFixedId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayGetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArraySetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayLenId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayCopyId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayFillId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayInitDataId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenArrayInitElemId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenRefAsId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringNewId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringConstId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringMeasureId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringEncodeId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringConcatId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringEqId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringAsId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringWTF16GetId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringIterNextId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringIterMoveId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringSliceWTFId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenStringSliceIterId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenContBindId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenContNewId() -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenResumeId() -> BinaryenExpressionId;
}
pub type BinaryenExternalKind = u32;
extern "C" {
    pub fn BinaryenExternalFunction() -> BinaryenExternalKind;
}
extern "C" {
    pub fn BinaryenExternalTable() -> BinaryenExternalKind;
}
extern "C" {
    pub fn BinaryenExternalMemory() -> BinaryenExternalKind;
}
extern "C" {
    pub fn BinaryenExternalGlobal() -> BinaryenExternalKind;
}
extern "C" {
    pub fn BinaryenExternalTag() -> BinaryenExternalKind;
}
pub type BinaryenFeatures = u32;
extern "C" {
    pub fn BinaryenFeatureMVP() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureAtomics() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureBulkMemory() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureMutableGlobals() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureNontrappingFPToInt() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureSignExt() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureSIMD128() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureExceptionHandling() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureTailCall() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureReferenceTypes() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureMultivalue() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureGC() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureMemory64() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureRelaxedSIMD() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureExtendedConst() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureStrings() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureMultiMemory() -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenFeatureAll() -> BinaryenFeatures;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenModule {
    _unused: [u8; 0],
}
pub type BinaryenModuleRef = *mut BinaryenModule;
extern "C" {
    pub fn BinaryenModuleCreate() -> BinaryenModuleRef;
}
extern "C" {
    pub fn BinaryenModuleDispose(module: BinaryenModuleRef);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BinaryenLiteral {
    pub type_: usize,
    pub __bindgen_anon_1: BinaryenLiteral__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BinaryenLiteral__bindgen_ty_1 {
    pub i32_: i32,
    pub i64_: i64,
    pub f32_: f32,
    pub f64_: f64,
    pub v128: [u8; 16usize],
    pub func: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BinaryenLiteral__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenLiteral__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenLiteral__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(BinaryenLiteral__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenLiteral__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(BinaryenLiteral__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(i32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(i64_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(f64_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v128) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(v128)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(func)
        )
    );
}
#[test]
fn bindgen_test_layout_BinaryenLiteral() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenLiteral> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenLiteral>(),
        24usize,
        concat!("Size of: ", stringify!(BinaryenLiteral))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenLiteral>(),
        8usize,
        concat!("Alignment of ", stringify!(BinaryenLiteral))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral),
            "::",
            stringify!(type_)
        )
    );
}
extern "C" {
    pub fn BinaryenLiteralInt32(x: i32) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralInt64(x: i64) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralFloat32(x: f32) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralFloat64(x: f64) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralVec128(x: *const u8) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralFloat32Bits(x: i32) -> BinaryenLiteral;
}
extern "C" {
    pub fn BinaryenLiteralFloat64Bits(x: i64) -> BinaryenLiteral;
}
pub type BinaryenOp = i32;
extern "C" {
    pub fn BinaryenClzInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCtzInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPopcntInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCeilFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenFloorFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNearestFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSqrtFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqZInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenClzInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCtzInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPopcntInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCeilFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenFloorFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNearestFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSqrtFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqZInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenWrapInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSFloat32ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSFloat32ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncUFloat32ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncUFloat32ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSFloat64ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSFloat64ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncUFloat64ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncUFloat64ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReinterpretFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReinterpretFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertSInt32ToFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertSInt32ToFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertUInt32ToFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertUInt32ToFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertSInt64ToFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertSInt64ToFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertUInt64ToFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertUInt64ToFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPromoteFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDemoteFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReinterpretInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReinterpretInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendS8Int32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendS16Int32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendS8Int64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendS16Int64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendS32Int64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRemSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRemUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAndInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenOrInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenXorInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRotLInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRotRInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeUInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRemSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRemUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAndInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenOrInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenXorInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRotLInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRotRInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeUInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCopySignFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeFloat32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCopySignFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeFloat64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWAdd() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWSub() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWAnd() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWOr() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWXor() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWXchg() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatSFloat32ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatSFloat32ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatUFloat32ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatUFloat32ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatSFloat64ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatSFloat64ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatUFloat64ToInt32() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatUFloat64ToInt64() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSplatVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtractLaneVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenReplaceLaneVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenEqVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNeVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLtVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGtVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLeVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenGeVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNotVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAndVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenOrVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenXorVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAndNotVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBitselectVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedFmaVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedFmsVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedFmaVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedFmsVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLaneselectI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLaneselectI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLaneselectI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLaneselectI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDotI8x16I7x16AddSToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAnyTrueVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPopcntVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAllTrueVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBitmaskVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddSatSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddSatUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubSatSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubSatUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxSVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAvgrUVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAllTrueVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBitmaskVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddSatSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddSatUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubSatSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubSatUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAvgrUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenQ15MulrSatSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighUVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAllTrueVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBitmaskVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDotSVecI16x8ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighSVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighUVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAllTrueVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBitmaskVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShlVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenShrUVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighSVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulLowUVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtMulHighUVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSqrtVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPMinVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPMaxVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCeilVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenFloorVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNearestVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAbsVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNegVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSqrtVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAddVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSubVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMulVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDivVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMinVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenMaxVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPMinVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPMaxVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenCeilVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenFloorVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNearestVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtAddPairwiseSVecI8x16ToI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtAddPairwiseUVecI8x16ToI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtAddPairwiseSVecI16x8ToI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtAddPairwiseUVecI16x8ToI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatSVecF32x4ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatUVecF32x4ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertSVecI32x4ToVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertUVecI32x4ToVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad8SplatVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad16SplatVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad32SplatVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad64SplatVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad8x8SVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad8x8UVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad16x4SVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad16x4UVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad32x2SVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad32x2UVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad32ZeroVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad64ZeroVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad8LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad16LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad32LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenLoad64LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStore8LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStore16LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStore32LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStore64LaneVec128() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNarrowSVecI16x8ToVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNarrowUVecI16x8ToVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNarrowSVecI32x4ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenNarrowUVecI32x4ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowSVecI8x16ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighSVecI8x16ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowUVecI8x16ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighUVecI8x16ToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowSVecI16x8ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighSVecI16x8ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowUVecI16x8ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighUVecI16x8ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowSVecI32x4ToVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighSVecI32x4ToVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendLowUVecI32x4ToVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenExtendHighUVecI32x4ToVecI64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertLowSVecI32x4ToVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenConvertLowUVecI32x4ToVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatZeroSVecF64x2ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenTruncSatZeroUVecF64x2ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDemoteZeroVecF64x2ToVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenPromoteLowVecF32x4ToVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedTruncSVecF32x4ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedTruncUVecF32x4ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedTruncZeroSVecF64x2ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedTruncZeroUVecF64x2ToVecI32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSwizzleVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedSwizzleVecI8x16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedMinVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedMaxVecF32x4() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedMinVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedMaxVecF64x2() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRelaxedQ15MulrSVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenDotI8x16I7x16SToVecI16x8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRefAsNonNull() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRefAsExternInternalize() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRefAsExternExternalize() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBrOnNull() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBrOnNonNull() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBrOnCast() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBrOnCastFail() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewUTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewWTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewLossyUTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewWTF16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewUTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewWTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewLossyUTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewWTF16Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewFromCodePoint() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureUTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureWTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureWTF16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureIsUSV() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureWTF16View() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeUTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeLossyUTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeWTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeWTF16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeUTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeLossyUTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeWTF8Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeWTF16Array() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringAsWTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringAsWTF16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringAsIter() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringIterMoveAdvance() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringIterMoveRewind() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringSliceWTF8() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringSliceWTF16() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEqEqual() -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEqCompare() -> BinaryenOp;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenExpression {
    _unused: [u8; 0],
}
pub type BinaryenExpressionRef = *mut BinaryenExpression;
extern "C" {
    pub fn BinaryenBlock(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        children: *mut BinaryenExpressionRef,
        numChildren: BinaryenIndex,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenIf(
        module: BinaryenModuleRef,
        condition: BinaryenExpressionRef,
        ifTrue: BinaryenExpressionRef,
        ifFalse: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLoop(
        module: BinaryenModuleRef,
        in_: *const ::std::os::raw::c_char,
        body: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBreak(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        condition: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSwitch(
        module: BinaryenModuleRef,
        names: *mut *const ::std::os::raw::c_char,
        numNames: BinaryenIndex,
        defaultName: *const ::std::os::raw::c_char,
        condition: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCall(
        module: BinaryenModuleRef,
        target: *const ::std::os::raw::c_char,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        returnType: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallIndirect(
        module: BinaryenModuleRef,
        table: *const ::std::os::raw::c_char,
        target: BinaryenExpressionRef,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        params: BinaryenType,
        results: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenReturnCall(
        module: BinaryenModuleRef,
        target: *const ::std::os::raw::c_char,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        returnType: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenReturnCallIndirect(
        module: BinaryenModuleRef,
        table: *const ::std::os::raw::c_char,
        target: BinaryenExpressionRef,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        params: BinaryenType,
        results: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLocalGet(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLocalSet(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLocalTee(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
        value: BinaryenExpressionRef,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenGlobalGet(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenGlobalSet(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLoad(
        module: BinaryenModuleRef,
        bytes: u32,
        signed_: bool,
        offset: u32,
        align: u32,
        type_: BinaryenType,
        ptr: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStore(
        module: BinaryenModuleRef,
        bytes: u32,
        offset: u32,
        align: u32,
        ptr: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
        type_: BinaryenType,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenConst(
        module: BinaryenModuleRef,
        value: BinaryenLiteral,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenUnary(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBinary(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        left: BinaryenExpressionRef,
        right: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSelect(
        module: BinaryenModuleRef,
        condition: BinaryenExpressionRef,
        ifTrue: BinaryenExpressionRef,
        ifFalse: BinaryenExpressionRef,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenDrop(
        module: BinaryenModuleRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenReturn(
        module: BinaryenModuleRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemorySize(
        module: BinaryenModuleRef,
        memoryName: *const ::std::os::raw::c_char,
        memoryIs64: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryGrow(
        module: BinaryenModuleRef,
        delta: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
        memoryIs64: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenNop(module: BinaryenModuleRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenUnreachable(module: BinaryenModuleRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicLoad(
        module: BinaryenModuleRef,
        bytes: u32,
        offset: u32,
        type_: BinaryenType,
        ptr: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicStore(
        module: BinaryenModuleRef,
        bytes: u32,
        offset: u32,
        ptr: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
        type_: BinaryenType,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicRMW(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        bytes: BinaryenIndex,
        offset: BinaryenIndex,
        ptr: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
        type_: BinaryenType,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchg(
        module: BinaryenModuleRef,
        bytes: BinaryenIndex,
        offset: BinaryenIndex,
        ptr: BinaryenExpressionRef,
        expected: BinaryenExpressionRef,
        replacement: BinaryenExpressionRef,
        type_: BinaryenType,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicWait(
        module: BinaryenModuleRef,
        ptr: BinaryenExpressionRef,
        expected: BinaryenExpressionRef,
        timeout: BinaryenExpressionRef,
        type_: BinaryenType,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicNotify(
        module: BinaryenModuleRef,
        ptr: BinaryenExpressionRef,
        notifyCount: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicFence(module: BinaryenModuleRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDExtract(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        vec: BinaryenExpressionRef,
        index: u8,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDReplace(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        vec: BinaryenExpressionRef,
        index: u8,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShuffle(
        module: BinaryenModuleRef,
        left: BinaryenExpressionRef,
        right: BinaryenExpressionRef,
        mask: *const u8,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDTernary(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        a: BinaryenExpressionRef,
        b: BinaryenExpressionRef,
        c: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShift(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        vec: BinaryenExpressionRef,
        shift: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDLoad(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        offset: u32,
        align: u32,
        ptr: BinaryenExpressionRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLane(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        offset: u32,
        align: u32,
        index: u8,
        ptr: BinaryenExpressionRef,
        vec: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryInit(
        module: BinaryenModuleRef,
        segment: *const ::std::os::raw::c_char,
        dest: BinaryenExpressionRef,
        offset: BinaryenExpressionRef,
        size: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenDataDrop(
        module: BinaryenModuleRef,
        segment: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryCopy(
        module: BinaryenModuleRef,
        dest: BinaryenExpressionRef,
        source: BinaryenExpressionRef,
        size: BinaryenExpressionRef,
        destMemory: *const ::std::os::raw::c_char,
        sourceMemory: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryFill(
        module: BinaryenModuleRef,
        dest: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
        size: BinaryenExpressionRef,
        memoryName: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefNull(module: BinaryenModuleRef, type_: BinaryenType)
        -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefIsNull(
        module: BinaryenModuleRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefAs(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefFunc(
        module: BinaryenModuleRef,
        func: *const ::std::os::raw::c_char,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefEq(
        module: BinaryenModuleRef,
        left: BinaryenExpressionRef,
        right: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableGet(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        index: BinaryenExpressionRef,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableSet(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        index: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableSize(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableGrow(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        value: BinaryenExpressionRef,
        delta: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTry(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        body: BinaryenExpressionRef,
        catchTags: *mut *const ::std::os::raw::c_char,
        numCatchTags: BinaryenIndex,
        catchBodies: *mut BinaryenExpressionRef,
        numCatchBodies: BinaryenIndex,
        delegateTarget: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenThrow(
        module: BinaryenModuleRef,
        tag: *const ::std::os::raw::c_char,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRethrow(
        module: BinaryenModuleRef,
        target: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTupleMake(
        module: BinaryenModuleRef,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTupleExtract(
        module: BinaryenModuleRef,
        tuple: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenPop(module: BinaryenModuleRef, type_: BinaryenType) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefI31(
        module: BinaryenModuleRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenI31Get(
        module: BinaryenModuleRef,
        i31: BinaryenExpressionRef,
        signed_: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallRef(
        module: BinaryenModuleRef,
        target: BinaryenExpressionRef,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        type_: BinaryenType,
        isReturn: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefTest(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        castType: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefCast(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        type_: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBrOn(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        name: *const ::std::os::raw::c_char,
        ref_: BinaryenExpressionRef,
        castType: BinaryenType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructNew(
        module: BinaryenModuleRef,
        operands: *mut BinaryenExpressionRef,
        numOperands: BinaryenIndex,
        type_: BinaryenHeapType,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructGet(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
        ref_: BinaryenExpressionRef,
        type_: BinaryenType,
        signed_: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructSet(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
        ref_: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNew(
        module: BinaryenModuleRef,
        type_: BinaryenHeapType,
        size: BinaryenExpressionRef,
        init: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNewData(
        module: BinaryenModuleRef,
        type_: BinaryenHeapType,
        name: *const ::std::os::raw::c_char,
        offset: BinaryenExpressionRef,
        size: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNewFixed(
        module: BinaryenModuleRef,
        type_: BinaryenHeapType,
        values: *mut BinaryenExpressionRef,
        numValues: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayGet(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        index: BinaryenExpressionRef,
        type_: BinaryenType,
        signed_: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArraySet(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        index: BinaryenExpressionRef,
        value: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayLen(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopy(
        module: BinaryenModuleRef,
        destRef: BinaryenExpressionRef,
        destIndex: BinaryenExpressionRef,
        srcRef: BinaryenExpressionRef,
        srcIndex: BinaryenExpressionRef,
        length: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringNew(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ptr: BinaryenExpressionRef,
        length: BinaryenExpressionRef,
        start: BinaryenExpressionRef,
        end: BinaryenExpressionRef,
        try_: bool,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringConst(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringMeasure(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ref_: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEncode(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ref_: BinaryenExpressionRef,
        ptr: BinaryenExpressionRef,
        start: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringConcat(
        module: BinaryenModuleRef,
        left: BinaryenExpressionRef,
        right: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEq(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        left: BinaryenExpressionRef,
        right: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringAs(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ref_: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF8Advance(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        pos: BinaryenExpressionRef,
        bytes: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF16Get(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        pos: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringIterNext(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringIterMove(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ref_: BinaryenExpressionRef,
        num: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceWTF(
        module: BinaryenModuleRef,
        op: BinaryenOp,
        ref_: BinaryenExpressionRef,
        start: BinaryenExpressionRef,
        end: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceIter(
        module: BinaryenModuleRef,
        ref_: BinaryenExpressionRef,
        num: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenExpressionGetId(expr: BinaryenExpressionRef) -> BinaryenExpressionId;
}
extern "C" {
    pub fn BinaryenExpressionGetType(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenExpressionSetType(expr: BinaryenExpressionRef, type_: BinaryenType);
}
extern "C" {
    pub fn BinaryenExpressionPrint(expr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenExpressionFinalize(expr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenExpressionCopy(
        expr: BinaryenExpressionRef,
        module: BinaryenModuleRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBlockGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenBlockSetName(expr: BinaryenExpressionRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenBlockGetNumChildren(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenBlockGetChildAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBlockSetChildAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        childExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenBlockAppendChild(
        expr: BinaryenExpressionRef,
        childExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenBlockInsertChildAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        childExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenBlockRemoveChildAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenIfGetCondition(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenIfSetCondition(expr: BinaryenExpressionRef, condExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenIfGetIfTrue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenIfSetIfTrue(expr: BinaryenExpressionRef, ifTrueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenIfGetIfFalse(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenIfSetIfFalse(expr: BinaryenExpressionRef, ifFalseExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenLoopGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenLoopSetName(expr: BinaryenExpressionRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenLoopGetBody(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLoopSetBody(expr: BinaryenExpressionRef, bodyExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBreakGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenBreakSetName(expr: BinaryenExpressionRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenBreakGetCondition(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBreakSetCondition(expr: BinaryenExpressionRef, condExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBreakGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBreakSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSwitchGetNumNames(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenSwitchGetNameAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenSwitchSetNameAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenSwitchAppendName(
        expr: BinaryenExpressionRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenSwitchInsertNameAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenSwitchRemoveNameAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenSwitchGetDefaultName(
        expr: BinaryenExpressionRef,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenSwitchSetDefaultName(
        expr: BinaryenExpressionRef,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenSwitchGetCondition(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSwitchSetCondition(expr: BinaryenExpressionRef, condExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSwitchGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSwitchSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenCallGetTarget(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenCallSetTarget(
        expr: BinaryenExpressionRef,
        target: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenCallGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallIsReturn(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenCallSetReturn(expr: BinaryenExpressionRef, isReturn: bool);
}
extern "C" {
    pub fn BinaryenCallIndirectGetTarget(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallIndirectSetTarget(
        expr: BinaryenExpressionRef,
        targetExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallIndirectGetTable(
        expr: BinaryenExpressionRef,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenCallIndirectSetTable(
        expr: BinaryenExpressionRef,
        table: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenCallIndirectGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallIndirectGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallIndirectSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallIndirectAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallIndirectInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallIndirectRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallIndirectIsReturn(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenCallIndirectSetReturn(expr: BinaryenExpressionRef, isReturn: bool);
}
extern "C" {
    pub fn BinaryenCallIndirectGetParams(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenCallIndirectSetParams(expr: BinaryenExpressionRef, params: BinaryenType);
}
extern "C" {
    pub fn BinaryenCallIndirectGetResults(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenCallIndirectSetResults(expr: BinaryenExpressionRef, params: BinaryenType);
}
extern "C" {
    pub fn BinaryenLocalGetGetIndex(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenLocalGetSetIndex(expr: BinaryenExpressionRef, index: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenLocalSetIsTee(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenLocalSetGetIndex(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenLocalSetSetIndex(expr: BinaryenExpressionRef, index: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenLocalSetGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLocalSetSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenGlobalGetGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenGlobalGetSetName(
        expr: BinaryenExpressionRef,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenGlobalSetGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenGlobalSetSetName(
        expr: BinaryenExpressionRef,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenGlobalSetGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenGlobalSetSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTableGetGetTable(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTableGetSetTable(
        expr: BinaryenExpressionRef,
        table: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTableGetGetIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableGetSetIndex(expr: BinaryenExpressionRef, indexExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTableSetGetTable(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTableSetSetTable(
        expr: BinaryenExpressionRef,
        table: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTableSetGetIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableSetSetIndex(expr: BinaryenExpressionRef, indexExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTableSetGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableSetSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTableSizeGetTable(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTableSizeSetTable(
        expr: BinaryenExpressionRef,
        table: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTableGrowGetTable(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTableGrowSetTable(
        expr: BinaryenExpressionRef,
        table: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTableGrowGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableGrowSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTableGrowGetDelta(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTableGrowSetDelta(expr: BinaryenExpressionRef, deltaExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenMemoryGrowGetDelta(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryGrowSetDelta(
        expr: BinaryenExpressionRef,
        deltaExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenLoadIsAtomic(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenLoadSetAtomic(expr: BinaryenExpressionRef, isAtomic: bool);
}
extern "C" {
    pub fn BinaryenLoadIsSigned(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenLoadSetSigned(expr: BinaryenExpressionRef, isSigned: bool);
}
extern "C" {
    pub fn BinaryenLoadGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenLoadSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenLoadGetBytes(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenLoadSetBytes(expr: BinaryenExpressionRef, bytes: u32);
}
extern "C" {
    pub fn BinaryenLoadGetAlign(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenLoadSetAlign(expr: BinaryenExpressionRef, align: u32);
}
extern "C" {
    pub fn BinaryenLoadGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenLoadSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStoreIsAtomic(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenStoreSetAtomic(expr: BinaryenExpressionRef, isAtomic: bool);
}
extern "C" {
    pub fn BinaryenStoreGetBytes(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenStoreSetBytes(expr: BinaryenExpressionRef, bytes: u32);
}
extern "C" {
    pub fn BinaryenStoreGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenStoreSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenStoreGetAlign(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenStoreSetAlign(expr: BinaryenExpressionRef, align: u32);
}
extern "C" {
    pub fn BinaryenStoreGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStoreSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStoreGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStoreSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStoreGetValueType(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenStoreSetValueType(expr: BinaryenExpressionRef, valueType: BinaryenType);
}
extern "C" {
    pub fn BinaryenConstGetValueI32(expr: BinaryenExpressionRef) -> i32;
}
extern "C" {
    pub fn BinaryenConstSetValueI32(expr: BinaryenExpressionRef, value: i32);
}
extern "C" {
    pub fn BinaryenConstGetValueI64(expr: BinaryenExpressionRef) -> i64;
}
extern "C" {
    pub fn BinaryenConstSetValueI64(expr: BinaryenExpressionRef, value: i64);
}
extern "C" {
    pub fn BinaryenConstGetValueI64Low(expr: BinaryenExpressionRef) -> i32;
}
extern "C" {
    pub fn BinaryenConstSetValueI64Low(expr: BinaryenExpressionRef, valueLow: i32);
}
extern "C" {
    pub fn BinaryenConstGetValueI64High(expr: BinaryenExpressionRef) -> i32;
}
extern "C" {
    pub fn BinaryenConstSetValueI64High(expr: BinaryenExpressionRef, valueHigh: i32);
}
extern "C" {
    pub fn BinaryenConstGetValueF32(expr: BinaryenExpressionRef) -> f32;
}
extern "C" {
    pub fn BinaryenConstSetValueF32(expr: BinaryenExpressionRef, value: f32);
}
extern "C" {
    pub fn BinaryenConstGetValueF64(expr: BinaryenExpressionRef) -> f64;
}
extern "C" {
    pub fn BinaryenConstSetValueF64(expr: BinaryenExpressionRef, value: f64);
}
extern "C" {
    pub fn BinaryenConstGetValueV128(expr: BinaryenExpressionRef, out: *mut u8);
}
extern "C" {
    pub fn BinaryenConstSetValueV128(expr: BinaryenExpressionRef, value: *const u8);
}
extern "C" {
    pub fn BinaryenUnaryGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenUnarySetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenUnaryGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenUnarySetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBinaryGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBinarySetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenBinaryGetLeft(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBinarySetLeft(expr: BinaryenExpressionRef, leftExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBinaryGetRight(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBinarySetRight(expr: BinaryenExpressionRef, rightExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSelectGetIfTrue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSelectSetIfTrue(expr: BinaryenExpressionRef, ifTrueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSelectGetIfFalse(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSelectSetIfFalse(
        expr: BinaryenExpressionRef,
        ifFalseExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenSelectGetCondition(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSelectSetCondition(expr: BinaryenExpressionRef, condExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenDropGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenDropSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenReturnGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenReturnSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicRMWGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenAtomicRMWSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenAtomicRMWGetBytes(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenAtomicRMWSetBytes(expr: BinaryenExpressionRef, bytes: u32);
}
extern "C" {
    pub fn BinaryenAtomicRMWGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenAtomicRMWSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenAtomicRMWGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicRMWSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicRMWGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicRMWSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgGetBytes(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgSetBytes(expr: BinaryenExpressionRef, bytes: u32);
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgGetExpected(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgSetExpected(
        expr: BinaryenExpressionRef,
        expectedExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgGetReplacement(
        expr: BinaryenExpressionRef,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicCmpxchgSetReplacement(
        expr: BinaryenExpressionRef,
        replacementExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenAtomicWaitGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicWaitSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicWaitGetExpected(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicWaitSetExpected(
        expr: BinaryenExpressionRef,
        expectedExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenAtomicWaitGetTimeout(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicWaitSetTimeout(
        expr: BinaryenExpressionRef,
        timeoutExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenAtomicWaitGetExpectedType(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenAtomicWaitSetExpectedType(
        expr: BinaryenExpressionRef,
        expectedType: BinaryenType,
    );
}
extern "C" {
    pub fn BinaryenAtomicNotifyGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicNotifySetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenAtomicNotifyGetNotifyCount(expr: BinaryenExpressionRef)
        -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenAtomicNotifySetNotifyCount(
        expr: BinaryenExpressionRef,
        notifyCountExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenAtomicFenceGetOrder(expr: BinaryenExpressionRef) -> u8;
}
extern "C" {
    pub fn BinaryenAtomicFenceSetOrder(expr: BinaryenExpressionRef, order: u8);
}
extern "C" {
    pub fn BinaryenSIMDExtractGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDExtractSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDExtractGetVec(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDExtractSetVec(expr: BinaryenExpressionRef, vecExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDExtractGetIndex(expr: BinaryenExpressionRef) -> u8;
}
extern "C" {
    pub fn BinaryenSIMDExtractSetIndex(expr: BinaryenExpressionRef, index: u8);
}
extern "C" {
    pub fn BinaryenSIMDReplaceGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDReplaceSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDReplaceGetVec(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDReplaceSetVec(expr: BinaryenExpressionRef, vecExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDReplaceGetIndex(expr: BinaryenExpressionRef) -> u8;
}
extern "C" {
    pub fn BinaryenSIMDReplaceSetIndex(expr: BinaryenExpressionRef, index: u8);
}
extern "C" {
    pub fn BinaryenSIMDReplaceGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDReplaceSetValue(
        expr: BinaryenExpressionRef,
        valueExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenSIMDShuffleGetLeft(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShuffleSetLeft(expr: BinaryenExpressionRef, leftExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDShuffleGetRight(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShuffleSetRight(
        expr: BinaryenExpressionRef,
        rightExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenSIMDShuffleGetMask(expr: BinaryenExpressionRef, mask: *mut u8);
}
extern "C" {
    pub fn BinaryenSIMDShuffleSetMask(expr: BinaryenExpressionRef, mask: *const u8);
}
extern "C" {
    pub fn BinaryenSIMDTernaryGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDTernarySetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDTernaryGetA(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDTernarySetA(expr: BinaryenExpressionRef, aExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDTernaryGetB(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDTernarySetB(expr: BinaryenExpressionRef, bExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDTernaryGetC(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDTernarySetC(expr: BinaryenExpressionRef, cExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDShiftGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDShiftSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDShiftGetVec(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShiftSetVec(expr: BinaryenExpressionRef, vecExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDShiftGetShift(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDShiftSetShift(expr: BinaryenExpressionRef, shiftExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDLoadGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDLoadSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDLoadGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenSIMDLoadSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenSIMDLoadGetAlign(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenSIMDLoadSetAlign(expr: BinaryenExpressionRef, align: u32);
}
extern "C" {
    pub fn BinaryenSIMDLoadGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDLoadSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetOffset(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetOffset(expr: BinaryenExpressionRef, offset: u32);
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetAlign(expr: BinaryenExpressionRef) -> u32;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetAlign(expr: BinaryenExpressionRef, align: u32);
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetIndex(expr: BinaryenExpressionRef) -> u8;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetIndex(expr: BinaryenExpressionRef, index: u8);
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetPtr(
        expr: BinaryenExpressionRef,
        ptrExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneGetVec(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneSetVec(
        expr: BinaryenExpressionRef,
        vecExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenSIMDLoadStoreLaneIsStore(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenMemoryInitGetSegment(
        expr: BinaryenExpressionRef,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenMemoryInitSetSegment(
        expr: BinaryenExpressionRef,
        segment: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenMemoryInitGetDest(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryInitSetDest(expr: BinaryenExpressionRef, destExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenMemoryInitGetOffset(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryInitSetOffset(
        expr: BinaryenExpressionRef,
        offsetExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenMemoryInitGetSize(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryInitSetSize(expr: BinaryenExpressionRef, sizeExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenDataDropGetSegment(expr: BinaryenExpressionRef)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenDataDropSetSegment(
        expr: BinaryenExpressionRef,
        segment: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenMemoryCopyGetDest(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryCopySetDest(expr: BinaryenExpressionRef, destExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenMemoryCopyGetSource(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryCopySetSource(
        expr: BinaryenExpressionRef,
        sourceExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenMemoryCopyGetSize(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryCopySetSize(expr: BinaryenExpressionRef, sizeExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenMemoryFillGetDest(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryFillSetDest(expr: BinaryenExpressionRef, destExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenMemoryFillGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryFillSetValue(
        expr: BinaryenExpressionRef,
        valueExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenMemoryFillGetSize(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenMemoryFillSetSize(expr: BinaryenExpressionRef, sizeExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenRefIsNullGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefIsNullSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenRefAsGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenRefAsSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenRefAsGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefAsSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenRefFuncGetFunc(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenRefFuncSetFunc(
        expr: BinaryenExpressionRef,
        funcName: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenRefEqGetLeft(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefEqSetLeft(expr: BinaryenExpressionRef, left: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenRefEqGetRight(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefEqSetRight(expr: BinaryenExpressionRef, right: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTryGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTrySetName(expr: BinaryenExpressionRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenTryGetBody(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTrySetBody(expr: BinaryenExpressionRef, bodyExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenTryGetNumCatchTags(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTryGetNumCatchBodies(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTryGetCatchTagAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTrySetCatchTagAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        catchTag: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTryAppendCatchTag(
        expr: BinaryenExpressionRef,
        catchTag: *const ::std::os::raw::c_char,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTryInsertCatchTagAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        catchTag: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTryRemoveCatchTagAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTryGetCatchBodyAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTrySetCatchBodyAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        catchExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenTryAppendCatchBody(
        expr: BinaryenExpressionRef,
        catchExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTryInsertCatchBodyAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        catchExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenTryRemoveCatchBodyAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTryHasCatchAll(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenTryGetDelegateTarget(
        expr: BinaryenExpressionRef,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenTrySetDelegateTarget(
        expr: BinaryenExpressionRef,
        delegateTarget: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTryIsDelegate(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenThrowGetTag(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenThrowSetTag(expr: BinaryenExpressionRef, tagName: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenThrowGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenThrowGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenThrowSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenThrowAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenThrowInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenThrowRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRethrowGetTarget(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenRethrowSetTarget(
        expr: BinaryenExpressionRef,
        target: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenTupleMakeGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTupleMakeGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTupleMakeSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenTupleMakeAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTupleMakeInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenTupleMakeRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTupleExtractGetTuple(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenTupleExtractSetTuple(
        expr: BinaryenExpressionRef,
        tupleExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenTupleExtractGetIndex(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenTupleExtractSetIndex(expr: BinaryenExpressionRef, index: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenRefI31GetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefI31SetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenI31GetGetI31(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenI31GetSetI31(expr: BinaryenExpressionRef, i31Expr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenI31GetIsSigned(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenI31GetSetSigned(expr: BinaryenExpressionRef, signed_: bool);
}
extern "C" {
    pub fn BinaryenCallRefGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallRefGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallRefSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallRefAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenCallRefInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenCallRefRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallRefGetTarget(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenCallRefSetTarget(expr: BinaryenExpressionRef, targetExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenCallRefIsReturn(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenCallRefSetReturn(expr: BinaryenExpressionRef, isReturn: bool);
}
extern "C" {
    pub fn BinaryenRefTestGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefTestSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenRefTestGetCastType(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenRefTestSetCastType(expr: BinaryenExpressionRef, intendedType: BinaryenType);
}
extern "C" {
    pub fn BinaryenRefCastGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenRefCastSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBrOnGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenBrOnSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenBrOnGetName(expr: BinaryenExpressionRef) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenBrOnSetName(expr: BinaryenExpressionRef, nameStr: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenBrOnGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenBrOnSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenBrOnGetCastType(expr: BinaryenExpressionRef) -> BinaryenType;
}
extern "C" {
    pub fn BinaryenBrOnSetCastType(expr: BinaryenExpressionRef, castType: BinaryenType);
}
extern "C" {
    pub fn BinaryenStructNewGetNumOperands(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenStructNewGetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructNewSetOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStructNewAppendOperand(
        expr: BinaryenExpressionRef,
        operandExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenStructNewInsertOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        operandExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStructNewRemoveOperandAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructGetGetIndex(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenStructGetSetIndex(expr: BinaryenExpressionRef, index: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenStructGetGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructGetSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStructGetIsSigned(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenStructGetSetSigned(expr: BinaryenExpressionRef, signed_: bool);
}
extern "C" {
    pub fn BinaryenStructSetGetIndex(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenStructSetSetIndex(expr: BinaryenExpressionRef, index: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenStructSetGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructSetSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStructSetGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStructSetSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayNewGetInit(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNewSetInit(expr: BinaryenExpressionRef, initExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayNewGetSize(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNewSetSize(expr: BinaryenExpressionRef, sizeExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayNewFixedGetNumValues(expr: BinaryenExpressionRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenArrayNewFixedGetValueAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayNewFixedSetValueAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        valueExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayNewFixedAppendValue(
        expr: BinaryenExpressionRef,
        valueExpr: BinaryenExpressionRef,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenArrayNewFixedInsertValueAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
        valueExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayNewFixedRemoveValueAt(
        expr: BinaryenExpressionRef,
        index: BinaryenIndex,
    ) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayGetGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayGetSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayGetGetIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayGetSetIndex(expr: BinaryenExpressionRef, indexExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayGetIsSigned(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenArrayGetSetSigned(expr: BinaryenExpressionRef, signed_: bool);
}
extern "C" {
    pub fn BinaryenArraySetGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArraySetSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArraySetGetIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArraySetSetIndex(expr: BinaryenExpressionRef, indexExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArraySetGetValue(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArraySetSetValue(expr: BinaryenExpressionRef, valueExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayLenGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayLenSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenArrayCopyGetDestRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopySetDestRef(
        expr: BinaryenExpressionRef,
        destRefExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayCopyGetDestIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopySetDestIndex(
        expr: BinaryenExpressionRef,
        destIndexExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayCopyGetSrcRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopySetSrcRef(
        expr: BinaryenExpressionRef,
        srcRefExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayCopyGetSrcIndex(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopySetSrcIndex(
        expr: BinaryenExpressionRef,
        srcIndexExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenArrayCopyGetLength(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenArrayCopySetLength(
        expr: BinaryenExpressionRef,
        lengthExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringNewGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringNewSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringNewGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringNewSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringNewGetLength(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringNewSetLength(
        expr: BinaryenExpressionRef,
        lengthExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringNewGetStart(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringNewSetStart(expr: BinaryenExpressionRef, startExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringNewGetEnd(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringNewSetEnd(expr: BinaryenExpressionRef, endExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringNewSetTry(expr: BinaryenExpressionRef, try_: bool);
}
extern "C" {
    pub fn BinaryenStringNewIsTry(expr: BinaryenExpressionRef) -> bool;
}
extern "C" {
    pub fn BinaryenStringConstGetString(
        expr: BinaryenExpressionRef,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenStringConstSetString(
        expr: BinaryenExpressionRef,
        stringStr: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenStringMeasureGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringMeasureSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringMeasureGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringMeasureSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringEncodeGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEncodeSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringEncodeGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEncodeSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringEncodeGetPtr(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEncodeSetPtr(expr: BinaryenExpressionRef, ptrExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringEncodeGetStart(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEncodeSetStart(
        expr: BinaryenExpressionRef,
        startExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringConcatGetLeft(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringConcatSetLeft(
        expr: BinaryenExpressionRef,
        leftExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringConcatGetRight(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringConcatSetRight(
        expr: BinaryenExpressionRef,
        rightExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringEqGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringEqSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringEqGetLeft(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEqSetLeft(expr: BinaryenExpressionRef, leftExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringEqGetRight(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringEqSetRight(expr: BinaryenExpressionRef, rightExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringAsGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringAsSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringAsGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringAsSetRef(expr: BinaryenExpressionRef, refExpr: BinaryenExpressionRef);
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceGetPos(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceSetPos(
        expr: BinaryenExpressionRef,
        posExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceGetBytes(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF8AdvanceSetBytes(
        expr: BinaryenExpressionRef,
        bytesExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringWTF16GetGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF16GetSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringWTF16GetGetPos(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringWTF16GetSetPos(
        expr: BinaryenExpressionRef,
        posExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringIterNextGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringIterNextSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringIterMoveGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringIterMoveSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringIterMoveGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringIterMoveSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringIterMoveGetNum(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringIterMoveSetNum(
        expr: BinaryenExpressionRef,
        numExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringSliceWTFGetOp(expr: BinaryenExpressionRef) -> BinaryenOp;
}
extern "C" {
    pub fn BinaryenStringSliceWTFSetOp(expr: BinaryenExpressionRef, op: BinaryenOp);
}
extern "C" {
    pub fn BinaryenStringSliceWTFGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceWTFSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringSliceWTFGetStart(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceWTFSetStart(
        expr: BinaryenExpressionRef,
        startExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringSliceWTFGetEnd(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceWTFSetEnd(
        expr: BinaryenExpressionRef,
        endExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringSliceIterGetRef(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceIterSetRef(
        expr: BinaryenExpressionRef,
        refExpr: BinaryenExpressionRef,
    );
}
extern "C" {
    pub fn BinaryenStringSliceIterGetNum(expr: BinaryenExpressionRef) -> BinaryenExpressionRef;
}
extern "C" {
    pub fn BinaryenStringSliceIterSetNum(
        expr: BinaryenExpressionRef,
        numExpr: BinaryenExpressionRef,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenFunction {
    _unused: [u8; 0],
}
pub type BinaryenFunctionRef = *mut BinaryenFunction;
extern "C" {
    pub fn BinaryenAddFunction(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        params: BinaryenType,
        results: BinaryenType,
        varTypes: *mut BinaryenType,
        numVarTypes: BinaryenIndex,
        body: BinaryenExpressionRef,
    ) -> BinaryenFunctionRef;
}
extern "C" {
    pub fn BinaryenAddFunctionWithHeapType(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        type_: BinaryenHeapType,
        varTypes: *mut BinaryenType,
        numVarTypes: BinaryenIndex,
        body: BinaryenExpressionRef,
    ) -> BinaryenFunctionRef;
}
extern "C" {
    pub fn BinaryenGetFunction(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenFunctionRef;
}
extern "C" {
    pub fn BinaryenRemoveFunction(module: BinaryenModuleRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenGetNumFunctions(module: BinaryenModuleRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenGetFunctionByIndex(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
    ) -> BinaryenFunctionRef;
}
extern "C" {
    pub fn BinaryenAddFunctionImport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalModuleName: *const ::std::os::raw::c_char,
        externalBaseName: *const ::std::os::raw::c_char,
        params: BinaryenType,
        results: BinaryenType,
    );
}
extern "C" {
    pub fn BinaryenAddTableImport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalModuleName: *const ::std::os::raw::c_char,
        externalBaseName: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenAddMemoryImport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalModuleName: *const ::std::os::raw::c_char,
        externalBaseName: *const ::std::os::raw::c_char,
        shared: u8,
    );
}
extern "C" {
    pub fn BinaryenAddGlobalImport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalModuleName: *const ::std::os::raw::c_char,
        externalBaseName: *const ::std::os::raw::c_char,
        globalType: BinaryenType,
        mutable_: bool,
    );
}
extern "C" {
    pub fn BinaryenAddTagImport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalModuleName: *const ::std::os::raw::c_char,
        externalBaseName: *const ::std::os::raw::c_char,
        params: BinaryenType,
        results: BinaryenType,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenMemory {
    _unused: [u8; 0],
}
pub type BinaryenMemoryRef = *mut BinaryenMemory;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenExport {
    _unused: [u8; 0],
}
pub type BinaryenExportRef = *mut BinaryenExport;
extern "C" {
    pub fn BinaryenAddExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenAddFunctionExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenAddTableExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenAddMemoryExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenAddGlobalExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenAddTagExport(
        module: BinaryenModuleRef,
        internalName: *const ::std::os::raw::c_char,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenGetExport(
        module: BinaryenModuleRef,
        externalName: *const ::std::os::raw::c_char,
    ) -> BinaryenExportRef;
}
extern "C" {
    pub fn BinaryenRemoveExport(
        module: BinaryenModuleRef,
        externalName: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenGetNumExports(module: BinaryenModuleRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenGetExportByIndex(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
    ) -> BinaryenExportRef;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenGlobal {
    _unused: [u8; 0],
}
pub type BinaryenGlobalRef = *mut BinaryenGlobal;
extern "C" {
    pub fn BinaryenAddGlobal(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        type_: BinaryenType,
        mutable_: bool,
        init: BinaryenExpressionRef,
    ) -> BinaryenGlobalRef;
}
extern "C" {
    pub fn BinaryenGetGlobal(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenGlobalRef;
}
extern "C" {
    pub fn BinaryenRemoveGlobal(module: BinaryenModuleRef, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenGetNumGlobals(module: BinaryenModuleRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenGetGlobalByIndex(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
    ) -> BinaryenGlobalRef;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenTag {
    _unused: [u8; 0],
}
pub type BinaryenTagRef = *mut BinaryenTag;
extern "C" {
    pub fn BinaryenAddTag(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        params: BinaryenType,
        results: BinaryenType,
    ) -> BinaryenTagRef;
}
extern "C" {
    pub fn BinaryenGetTag(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenTagRef;
}
extern "C" {
    pub fn BinaryenRemoveTag(module: BinaryenModuleRef, name: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenTable {
    _unused: [u8; 0],
}
pub type BinaryenTableRef = *mut BinaryenTable;
extern "C" {
    pub fn BinaryenAddTable(
        module: BinaryenModuleRef,
        table: *const ::std::os::raw::c_char,
        initial: BinaryenIndex,
        maximum: BinaryenIndex,
        tableType: BinaryenType,
    ) -> BinaryenTableRef;
}
extern "C" {
    pub fn BinaryenRemoveTable(module: BinaryenModuleRef, table: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn BinaryenGetNumTables(module: BinaryenModuleRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenGetTable(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenTableRef;
}
extern "C" {
    pub fn BinaryenGetTableByIndex(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
    ) -> BinaryenTableRef;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenElementSegment {
    _unused: [u8; 0],
}
pub type BinaryenElementSegmentRef = *mut BinaryenElementSegment;
extern "C" {
    pub fn BinaryenAddActiveElementSegment(
        module: BinaryenModuleRef,
        table: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        funcNames: *mut *const ::std::os::raw::c_char,
        numFuncNames: BinaryenIndex,
        offset: BinaryenExpressionRef,
    ) -> BinaryenElementSegmentRef;
}
extern "C" {
    pub fn BinaryenAddPassiveElementSegment(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
        funcNames: *mut *const ::std::os::raw::c_char,
        numFuncNames: BinaryenIndex,
    ) -> BinaryenElementSegmentRef;
}
extern "C" {
    pub fn BinaryenRemoveElementSegment(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenGetNumElementSegments(module: BinaryenModuleRef) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenGetElementSegment(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenElementSegmentRef;
}
extern "C" {
    pub fn BinaryenGetElementSegmentByIndex(
        module: BinaryenModuleRef,
        index: BinaryenIndex,
    ) -> BinaryenElementSegmentRef;
}
extern "C" {
    pub fn BinaryenSetMemory(
        module: BinaryenModuleRef,
        initial: BinaryenIndex,
        maximum: BinaryenIndex,
        exportName: *const ::std::os::raw::c_char,
        segmentNames: *mut *const ::std::os::raw::c_char,
        segmentDatas: *mut *const ::std::os::raw::c_char,
        segmentPassives: *mut bool,
        segmentOffsets: *mut BinaryenExpressionRef,
        segmentSizes: *mut BinaryenIndex,
        numSegments: BinaryenIndex,
        shared: bool,
        memory64: bool,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenHasMemory(module: BinaryenModuleRef) -> bool;
}
extern "C" {
    pub fn BinaryenMemoryGetInitial(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenMemoryHasMax(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn BinaryenMemoryGetMax(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenMemoryImportGetModule(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenMemoryImportGetBase(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenMemoryIsShared(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn BinaryenMemoryIs64(
        module: BinaryenModuleRef,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn BinaryenGetNumMemorySegments(module: BinaryenModuleRef) -> u32;
}
extern "C" {
    pub fn BinaryenGetMemorySegmentByteOffset(
        module: BinaryenModuleRef,
        segmentName: *const ::std::os::raw::c_char,
    ) -> u32;
}
extern "C" {
    pub fn BinaryenGetMemorySegmentByteLength(
        module: BinaryenModuleRef,
        segmentName: *const ::std::os::raw::c_char,
    ) -> usize;
}
extern "C" {
    pub fn BinaryenGetMemorySegmentPassive(
        module: BinaryenModuleRef,
        segmentName: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn BinaryenCopyMemorySegmentData(
        module: BinaryenModuleRef,
        segmentName: *const ::std::os::raw::c_char,
        buffer: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenAddDataSegment(
        module: BinaryenModuleRef,
        segmentName: *const ::std::os::raw::c_char,
        memoryName: *const ::std::os::raw::c_char,
        segmentPassive: bool,
        segmentOffset: BinaryenExpressionRef,
        segmentData: *const ::std::os::raw::c_char,
        segmentSize: BinaryenIndex,
    );
}
extern "C" {
    pub fn BinaryenSetStart(module: BinaryenModuleRef, start: BinaryenFunctionRef);
}
extern "C" {
    pub fn BinaryenModuleGetFeatures(module: BinaryenModuleRef) -> BinaryenFeatures;
}
extern "C" {
    pub fn BinaryenModuleSetFeatures(module: BinaryenModuleRef, features: BinaryenFeatures);
}
extern "C" {
    pub fn BinaryenModuleParse(text: *const ::std::os::raw::c_char) -> BinaryenModuleRef;
}
extern "C" {
    pub fn BinaryenModulePrint(module: BinaryenModuleRef);
}
extern "C" {
    pub fn BinaryenModulePrintStackIR(module: BinaryenModuleRef, optimize: bool);
}
extern "C" {
    pub fn BinaryenModulePrintAsmjs(module: BinaryenModuleRef);
}
extern "C" {
    pub fn BinaryenModuleValidate(module: BinaryenModuleRef) -> bool;
}
extern "C" {
    pub fn BinaryenModuleOptimize(module: BinaryenModuleRef);
}
extern "C" {
    pub fn BinaryenModuleUpdateMaps(module: BinaryenModuleRef);
}
extern "C" {
    pub fn BinaryenGetOptimizeLevel() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn BinaryenSetOptimizeLevel(level: ::std::os::raw::c_int);
}
extern "C" {
    pub fn BinaryenGetShrinkLevel() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn BinaryenSetShrinkLevel(level: ::std::os::raw::c_int);
}
extern "C" {
    pub fn BinaryenGetDebugInfo() -> bool;
}
extern "C" {
    pub fn BinaryenSetDebugInfo(on: bool);
}
extern "C" {
    pub fn BinaryenGetLowMemoryUnused() -> bool;
}
extern "C" {
    pub fn BinaryenSetLowMemoryUnused(on: bool);
}
extern "C" {
    pub fn BinaryenGetZeroFilledMemory() -> bool;
}
extern "C" {
    pub fn BinaryenSetZeroFilledMemory(on: bool);
}
extern "C" {
    pub fn BinaryenGetFastMath() -> bool;
}
extern "C" {
    pub fn BinaryenSetFastMath(value: bool);
}
extern "C" {
    pub fn BinaryenGetPassArgument(
        name: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenSetPassArgument(
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn BinaryenClearPassArguments();
}
extern "C" {
    pub fn BinaryenGetAlwaysInlineMaxSize() -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenSetAlwaysInlineMaxSize(size: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenGetFlexibleInlineMaxSize() -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenSetFlexibleInlineMaxSize(size: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenGetOneCallerInlineMaxSize() -> BinaryenIndex;
}
extern "C" {
    pub fn BinaryenSetOneCallerInlineMaxSize(size: BinaryenIndex);
}
extern "C" {
    pub fn BinaryenGetAllowInliningFunctionsWithLoops() -> bool;
}
extern "C" {
    pub fn BinaryenSetAllowInliningFunctionsWithLoops(enabled: bool);
}
extern "C" {
    pub fn BinaryenModuleRunPasses(
        module: BinaryenModuleRef,
        passes: *mut *const ::std::os::raw::c_char,
        numPasses: BinaryenIndex,
    );
}
extern "C" {
    pub fn BinaryenModuleAutoDrop(module: BinaryenModuleRef);
}
extern "C" {
    pub fn BinaryenModuleWrite(
        module: BinaryenModuleRef,
        output: *mut ::std::os::raw::c_char,
        outputSize: usize,
    ) -> usize;
}
extern "C" {
    pub fn BinaryenModuleWriteText(
        module: BinaryenModuleRef,
        output: *mut ::std::os::raw::c_char,
        outputSize: usize,
    ) -> usize;
}
extern "C" {
    pub fn BinaryenModuleWriteStackIR(
        module: BinaryenModuleRef,
        output: *mut ::std::os::raw::c_char,
        outputSize: usize,
        optimize: bool,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenBufferSizes {
    pub outputBytes: usize,
    pub sourceMapBytes: usize,
}
#[test]
fn bindgen_test_layout_BinaryenBufferSizes() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenBufferSizes> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenBufferSizes>(),
        16usize,
        concat!("Size of: ", stringify!(BinaryenBufferSizes))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenBufferSizes>(),
        8usize,
        concat!("Alignment of ", stringify!(BinaryenBufferSizes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outputBytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenBufferSizes),
            "::",
            stringify!(outputBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceMapBytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenBufferSizes),
            "::",
            stringify!(sourceMapBytes)
        )
    );
}
extern "C" {
    pub fn BinaryenModuleWriteWithSourceMap(
        module: BinaryenModuleRef,
        url: *const ::std::os::raw::c_char,
        output: *mut ::std::os::raw::c_char,
        outputSize: usize,
        sourceMap: *mut ::std::os::raw::c_char,
        sourceMapSize: usize,
    ) -> BinaryenBufferSizes;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenModuleAllocateAndWriteResult {
    pub binary: *mut ::std::os::raw::c_void,
    pub binaryBytes: usize,
    pub sourceMap: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BinaryenModuleAllocateAndWriteResult() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenModuleAllocateAndWriteResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenModuleAllocateAndWriteResult>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(BinaryenModuleAllocateAndWriteResult)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenModuleAllocateAndWriteResult>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BinaryenModuleAllocateAndWriteResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binary) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(binary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binaryBytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(binaryBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceMap) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(sourceMap)
        )
    );
}
extern "C" {
    pub fn BinaryenModuleAllocateAndWrite(
        module: BinaryenModuleRef,
        sourceMapUrl: *const ::std::os::raw::c_char,
    ) -> BinaryenModuleAllocateAndWriteResult;
}
extern "C" {
    pub fn BinaryenModuleAllocateAndWriteText(
        module: BinaryenModuleRef,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenModuleAllocateAndWriteStackIR(
        module: BinaryenModuleRef,
        optimize: bool,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn BinaryenModuleRead(
        input: *mut ::std::os::raw::c_char,
        inputSize: usize,
    ) -> BinaryenModuleRef;
}
extern "C" {
    pub fn BinaryenModuleReadWithFeatures(
        input: *mut ::std::os::raw::c_char,
        inputSize: usize,
        featureSet: BinaryenFeatures,
    ) -> BinaryenModuleRef;
}
extern "C" {
